import job

def test_load_api_json():
    j = job.JobClass()
    testcase = [
        {
            'args': [{'category_id': 210, 'category_name': '食費', 'count': 209, 'price': [0, 1690, 32414, 126738, 8593, 0, 0, 0, 0, 0, 0, 0], 'total': 169435},
                     {'category_id': 230, 'category_name': 'コンピュータリソース', 'count': 15, 'price': [0, 268, 0, 18449, 4929, 0, 0, 0, 0, 0, 0, 0], 'total': 23646}
            ],
            'want': {'210': ['食費', 0, 1690, 32414, 126738, 8593, 0, 0, 0, 0, 0, 0, 0],
                     '230': ['コンピュータリソース', 0, 268, 0, 18449, 4929, 0, 0, 0, 0, 0, 0, 0],
            }
        }
    ]
    for t in testcase:
        args = t['args']
        want = t['want']
        assert j._load_api_json(args) == want


def test_make_write_data():
    j = job.JobClass()
    testcase = [
        {
            #1 No change
            'sheet_fetch_data': [
                ['THIS IS TEST VERSION', '', '', '', '', '', '', '', '', '', '', '', '', '', '最終更新日', '10/8/2023, 22:25:55', '', ''],
                ['ID', '', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月', '1月', '2月', '3月', '合計', '', '', '']
            ],
            'want': [
                ['THIS IS TEST VERSION', '', '', '', '', '', '', '', '', '', '', '', '', '', '最終更新日', '10/8/2023, 22:25:55', '', ''],
                ['ID', '', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月', '1月', '2月', '3月', '合計', '', '', '']
            ],
            'api_dict': {
                '210': ['食費', 0, 1690, 32414, 126738, 8593, 0, 0, 0, 0, 0, 0, 0],
                '230': ['コンピュータリソース', 0, 268, 0, 18449, 4929, 0, 0, 0, 0, 0, 0, 0],
            }
        },
        {
            #2 change
            'sheet_fetch_data': [
                ['THIS IS TEST VERSION', '', '', '', '', '', '', '', '', '', '', '', '', '', '最終更新日', '10/8/2023, 22:25:55', '', ''],
                ['ID', '', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月', '1月', '2月', '3月', '合計', '', '', ''],
                ['210', '食費', '￥0', '￥1,690', '￥32,414', '￥126,738', '￥10,073', '￥0', '￥0', '￥0', '￥0', '￥0', '￥0', '￥0', '￥170,915', '', '¥45,000', '0%']
            ],
            'want': [
                ['THIS IS TEST VERSION', '', '', '', '', '', '', '', '', '', '', '', '', '', '最終更新日', '10/8/2023, 22:25:55', '', ''],
                ['ID', '', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月', '1月', '2月', '3月', '合計', '', '', ''],
                ['210', '食費', 0, 1690, 32414, 126738, 8593, 0, 0, 0, 0, 0, 0, 0, '￥170,915', '', '¥45,000', '0%']
            ],
            'api_dict': {
                '210': ['食費', 0, 1690, 32414, 126738, 8593, 0, 0, 0, 0, 0, 0, 0],
                '230': ['コンピュータリソース', 0, 268, 0, 18449, 4929, 0, 0, 0, 0, 0, 0, 0],
            }
        },
    ]
    for t in testcase:
        args = t['api_dict']
        want = t['want']
        j.sheet_fetch_data = t['sheet_fetch_data']
        assert j._make_write_data(args) == want
